const arcade={"Лёгкая":{"0":{'question':'В отеле 4 этажа. Чем выше этаж, тем больше людей там живёт. На какой этаж чаще ездит лифт?','variants':['1','2','3','4'],'hints':['Не зависит от числа этажей'],'correctAnswer':[['1'],0]},"1":{'question':'На двух руках 10 пальцев. Сколько пальцев на 10 руках?','variants':['100','50','20','10'],'hints':['-1'],'correctAnswer':[['50'],0]},"2":{'question':'На продажу выставили 10 автомобилей. Все, кроме девяти, купили. Сколько автомобилей осталось?','variants':['10','0','9','1'],'hints':['-1'],'correctAnswer':[['9'],0]},"3":{'question':'Пять землекопов за 5 часов выкапывают 5 метров канавы. Сколько потребуется землекопов для того, чтобы выкопать 100 метров канавы за 100 часов?','variants':['13','2','9','5'],'hints':['-1'],'correctAnswer':[['5'],0]},"4":{'question':'Пете и Коле купили по коробке конфет. В каждой коробке находится 12 конфет. Петя из своей коробки съел несколько конфет, а Коля из своей коробки съел столько конфет, сколько осталось в коробке у Пети. Сколько конфет осталось на двоих у Пети и Коли?','variants':['7','21','12','11'],'hints':['-1'],'correctAnswer':[['12'],0]},"5":{'question':'Настя говорит, что Оля врёт. Оля же убеждает в том, что врёт Вадим. Вадим возмущённо утверждает, что врут и Оля, и Настя. Так кто же из троих врёт?','variants':['Настя','Оля','Вадим','Никто'],'hints':['-1'],'correctAnswer':[['Ольга','Оля'],6]},"6":{'question':'В спортивном турнире заявлено 5623 участника. Сколько нужно состязаний, чтобы выявить победителя?','variants':['5620','5622','5623','5621'],'hints':['-1'],'correctAnswer':[['5622'],0]},"7":{'question':'Что не вместится даже в самую большую кастрюлю?','variants':['nan','nan','nan','nan'],'hints':['Одна из частей кастрюли'],'correctAnswer':[['Крышка_этой_кастрюли','Крышка_кастрюли','Крышка_от_кастрюли','Крышка'],-1]},"8":{'question':'Где впервые был обнаружен картофель?','variants':['В земле','В России','На дереве','В Азии'],'hints':['-1'],'correctAnswer':[['В_земле'],0]},"9":{'question':'Ты садишься в машину, но ноги до педалей не достают. Что нужно сделать?','variants':['Положить кирпич на педали','Пересесть на водительское место','nan','nan'],'hints':['-1'],'correctAnswer':[['Пересесть_на_водительское_место'],0]},"10":{'question':'У фрау и герр Майерс есть 4 дочери. У каждой дочери есть один брат. Сколько всего детей у Майерсов?','variants':['5','8','6','7'],'hints':['-1'],'correctAnswer':[['5'],0]},"11":{'question':'Пете и Коле купили по коробке конфет. В каждой коробке находится 12 конфет. Петя из своей коробки съел несколько конфет, а Коля из своей коробки съел столько конфет, сколько осталось в коробке у Пети. Сколько конфет осталось на двоих у Пети и Коли?','variants':['7','21','12','11'],'hints':['-1'],'correctAnswer':[['12'],0]},"12":{'question':'В комнате есть свеча и керосиновая лампа. Что вы зажжёте первым, когда вечером войдёте в эту комнату?','variants':['Свеча','Керосиновая лампа','Спичка','nan'],'hints':['-1'],'correctAnswer':[['Спичка'],0]},"13":{'question':'Три курицы несут три яйца за три дня. Сколько яиц снесут 12 куриц за 12 дней?','variants':['12','24','36','48'],'hints':['-1'],'correctAnswer':[['48'],0]},"14":{'question':'Катя живёт на четвёртом этаже, а Оля – на втором. Поднимаясь на четвёртый этаж, Катя преодолевает 60 ступенек. Сколько ступенек надо пройти Оле, чтобы подняться на второй этаж?','variants':['40','30','20','nan'],'hints':['-1'],'correctAnswer':[['20'],0]},"15":{'question':'Бутылка с пробкой стоит 1 р. 10 к. Бутылка дороже пробки на 1 р. Сколько стоит бутылка?','variants':['1 рубль','90 копеек','1 рубль 5 копеек','nan'],'hints':['-1'],'correctAnswer':[['1_рубль_5_копеек'],0]},"16":{'question':'Сколько у вас было всего прапрадедушек и прапрабабушек?','variants':['4','6','8','16'],'hints':['Вспомните родословное дерево'],'correctAnswer':[['8'],0]},"17":{'question':'Из Москвы во Владивосток каждый день выходит поезд. Так же каждый день из Владивостока в Москву выходит поезд. Переезд длится 10 дней. Если вы выехали из Владивостока в Москву, то сколько поездов, идущих в обратном направлении, встретится вам во время поездки?','variants':['10','5','15','20'],'hints':['-1'],'correctAnswer':[['20'],0]},"18":{'question':'Если три дня назад был день, предшествующий понедельнику, то какой день будет послезавтра?','variants':['среда','четверг','пятница','суббота'],'hints':['-1'],'correctAnswer':[['пятница'],0]},"19":{'question':'Врач прописал больному три таблетки и велел принимать их через каждые полчаса. Сколько времени уйдет на прием таблеток?','variants':['Полтора часа','Час','Два часа','nan'],'hints':['-1'],'correctAnswer':[['Час'],0]}},"Средняя":{"0":{'question':'Убийца приговорен к смертной казни. Он должен выбрать одну из трех комнат: в первой бушуют пожары, вторая — полна убийц с заряженными ружьями, а в третьей — много львов, которые не ели три года. Какая комната будет самой безопасной?','variants':['nan','nan','nan','nan'],'hints':['Время имеет значение'],'correctAnswer':[['Комната_со_львами'],-1]},"1":{'question':'Когда человек находится дома без головы?','variants':['nan','nan','nan','nan'],'hints':['Окно'],'correctAnswer':[['Когда_выглядывает_из_окна','Когда_выглядывает_из_форточки','Когда_высунул_голову_в_окно','Когда_высунул_голову_в_форточку'],-1]},"2":{'question':'Есть 18 попугаев. Все, кроме двух, - красные. Все красные, кроме трёх, - вредные. Все вредные красные попугаи, кроме четырёх, дразнятся. Сколько вредных красных попугаев дразнятся?','variants':['nan','nan','nan','nan'],'hints':['-1'],'correctAnswer':[['9'],-1]},"3":{'question':'Арбуз весит на 6 кг больше, чем пол-арбуза. Сколько кг весит арбуз?','variants':['nan','nan','nan','nan'],'hints':['-1'],'correctAnswer':[['12'],-1]},"4":{'question':'Семь сестер находятся на даче, где каждая занята каким-то делом. Первая сестра читает книгу, вторая — готовит еду, третья — играет в шахматы, четвертая — разгадывает судоку, пятая — занимается стиркой, шестая — ухаживает за растениями. А чем занимается седьмая сестра?','variants':['nan','nan','nan','nan'],'hints':['Для этого требуется два человека'],'correctAnswer':[['Играет_в_шахматы','Играет_в_шахматы_с_сестрой','Играет_в_шахматы_со_своей_сестрой'],-1]},"5":{'question':'Женщина сидела в своем номере в отеле и услышала стук в дверь. Она открыла дверь и увидела незнакомого мужчину. Мужчина сказал: "Извините, я ошибся. Я думал, это мой номер". Мужчина ушел по коридору к лифту, а женщина позвонила охране. Что вызвало подозрение у женщины?','variants':['nan','nan','nan','nan'],'hints':['Что неестественного сделал мужчина если он думал что это его номер'],'correctAnswer':[['Человек_не_будет_стучать_в_дверь_собственного_номера_в_отеле'],-1]},"6":{'question':'Лукреция пригласила подругу в гости. После сытного ужина из жареной оленины с овощами и вином, Лукреция предложила подруге яблоко. "Осталось только одно яблоко, я настаиваю, чтобы ты его съела". Однако та отказалась, и тогда Лукреция  решила аккуратно разделить яблоко наполовину своим самым острым ножом. Каждая съела свою половинку, как вдруг глаза подруги закатились, и она упала, скончавшись.','variants':['nan','nan','nan','nan'],'hints':['Всё ли в порядке с ножом?'],'correctAnswer':[['Она_использовала_нож,_покрытый_ядом_только_с_одной_стороны'],-1]},"7":{'question':'Две девушки обедали. Обе заказали чай со льдом. Одна девушка выпила чай очень быстро и смогла выпить 5 чашек за время, которое потребовалось другой, чтобы выпить только одну чашку. Девушка, которая выпила одну чашку, умерла, а другая выжила. Все напитки были отравлены. Как смогла выжить девушка, которая выпила больше всего чая?','variants':['nan','nan','nan','nan'],'hints':['Всё дело в дозировке'],'correctAnswer':[['Яд_был_во_льду'],-1]},"8":{'question':'Мужчину нашли убитым в воскресенье утром. Его жена позвонила в полицию, которая допросила жену и всех, кто был в доме. Они дали следующие алиби: жена говорит, что она спала, дворецкий убирал в чулане, садовник собирал овощи, служанка получала почту, а повар готовил завтрак. Полиция тут же арестовала убийцу. Как узнала полиция кто убийца?','variants':['nan','nan','nan','nan'],'hints':['Выходной'],'correctAnswer':[['По_воскресеньям_нет_почты'],-1]},"9":{'question':'Дочь была на похоронах матери, когда она встретила мужчину. Мужчина ей понравился и она хотела с ним познакомиться. Пока она гуляла, она поняла, что не узнала ни имя, ни номер телефона мужчины. Позже, когда она вернулась, чтобы найти его, но он уже ушел. Через неделю она убила своего старшего брата, чтобы найти мужчину. Почему?','variants':['nan','nan','nan','nan'],'hints':['Где в первый раз она встретила того мужчину?'],'correctAnswer':[['Чтобы_мужчина_снова_мог_придти_на_похороны'],-1]},"10":{'question':'Средневековье, вы прислуживаете при королевском дворе. В один из дней король обвиняет вас в шпионаже и велит казнить. Но, предлагает выбрать способ смерти. Какой смерти попросить, чтобы выжить?','variants':['nan','nan','nan','nan'],'hints':['Естественная причина'],'correctAnswer':[['Смерть_от_старости'],-1]}},"Сложная":{"0":{'question':'6636 — 3, 8118 — 4, 2242 — 0, 3316 — ?','variants':['1','3','4','5'],'hints':['-1'],'correctAnswer':[['1'],0]},"1":{'question':'Он, он, она, он, она, …, оно. Что должно быть на месте пропуска?','variants':['Он','Она','Они','Оно'],'hints':['-1'],'correctAnswer':[['Она'],0]},"2":{'question':'Один мужчина выполнял опасную и сложную работу, поэтому и должен был носить маску для защиты. Вдруг, ни с того ни с сего, он сорвал с себя маску и ….. умер. Дома его ждала любимая семья, на работе тоже все было хорошо, т.е. причин покончить жизнь самоубийством у него не было. Кроме того, наркотики и алкоголь он тоже не употреблял. Однако, что-то все-таки заставило его снять маску?','variants':['nan','nan','nan','nan'],'hints':['-1'],'correctAnswer':[['Он_был_водолазом','Работа_водолазом','Водолаз'],-1]},"3":{'question':'Одна богатая семья жила в большом, круглом доме. У них была горничная, дворецкий и садовник. Родители пошли на вечеринку, оставив детей дома. Пока родители отсутствовали, дворецкий накормил детей, горничная убирала пыль в углах, а садовник поливал цветы.  Когда родители пришли домой, дети были мертвы. Кто убил детей?','variants':['Родители','Горничная','Садовник','Дворецкий'],'hints':['-1'],'correctAnswer':[['Горничная'],0]},"4":{'question':'Дочь была на похоронах матери, когда она встретила мужчину. Мужчина ей понравился и она хотела с ним познакомиться. Пока она гуляла, она поняла, что не узнала ни имя, ни номер телефона мужчины. Позже, когда она вернулась, чтобы найти его, но он уже ушел. Через неделю она убила своего старшего брата, чтобы найти мужчину. Почему?','variants':['nan','nan','nan','nan'],'hints':['-1'],'correctAnswer':[['Чтобы_мужчина_снова_мог_придти_на_похороны'],-1]}}}
const story = {
    "0": {
        a: "Вы - частный детектив и сейчас находитесь в своем кабинете. \n Вдруг к вам заходит женщина и говорит: 'Здравствуйте! Мне нужна ваша помощь. У меня пропала дочь неделю назад. Полиция её ищет, но всё безуспешно. Сможете мне помочь?'",
        b: 0,
        c: ["8", "7"],
        p: "1030494/da784de05cbaac96cc8b",
        t: '<speaker audio="alice-sounds-game-boot-1.opus">',
        "8": {
            a: "Женщина говорит:'Большое спасибо, тут я написала всё, что может пригодится в поиске',- и протягивает записку. \n Записка написана непонятным почерком и чтобы его разгадать прийдется постараться.",
            b: 1,
            c: ["01"],
            t: '<speaker audio="alice-music-guitar-a-1.opus">'
        },
        "7": {
            a: "'Очень жаль.. До свидания!'",
            b: -1,
            c: ["01"],
            t: '<speaker audio="alice-music-guitar-e-1.opus">',
        },
        "1": {
            a: "Девушка ушла, а через 2 часа после её визита вам позвонили на телефон. Ответить?",
            b: 0,
            c: ["0", "1"],
            t: '<speaker audio="alice-sounds-things-phone-2.opus">',
            "0": {
                a: "Говорит мужчина:\n'Здравствуйте! У меня пропала дочь, вы поможете мне её найти?'",
                b: 0,
                c: ["0", "1"],
                "0": {
                    a: "Мужчина:\n-Я тогда пришлю вам все данные, которые вам может быть помогут.*Данные пришли на телефон детектива*",
                    b: -1,
                    c: ["02"],
                    t: '<speaker audio="alice-music-guitar-a-1.opus">',
                },
                "1": {
                    a: "'Хорошо, я обращусь в другое агенство',-сказал клиент. \n К Вам приходит начальник и говорит:'Вы не справляетесь со своей работой, и я вынужден вас уволить, до свидания'",
                    b: -1,
                    c: ["09"],
                    t: '<speaker audio="alice-music-guitar-e-1.opus">',
                    g: '<speaker audio="alice-sounds-game-loss-3.opus">',
                },
            },
            "1": {
                a: "К Вам приходит начальник и говорит:'Вы не справляетесь со своей работой, и я вынужден вас уволить, до свидания'",
                b: -1,
                c: ["09"],
                g: '<speaker audio="alice-sounds-game-loss-3.opus">',
            },
        },
        "2": {
            a: "Прошел час, раздаётся телефонный звонок. Ответить?",
            b: 0,
            c: ["0", "1"],
            t: '<speaker audio="alice-sounds-things-phone-2.opus">',
            "0": {
                a: "Говорит Женщина:'Добрый день! Мой сын куда-то пропал. Вы сможете мне помочь?'",
                b: 0,
                c: ["0", "1"],
                "0": {
                    a: "Женщина:'Я отправлю вам ссылку на страницу сына в соцсети'.",
                    b: 2,
                    c: ["03"],
                    t: '<speaker audio="alice-music-guitar-a-1.opus">',
                },
                "1": {
                    a: "*Приходит начальник детектива* и говорит:-Вы не выполняете должно свои обязанности, поэтому  я вынужден вас уволить. До свидания!*Прошло 2 недели. Домой к бывшему детективу кто-то стучится, но глазок закрыт*Открыть дверь?",
                    b: -1,
                    c: ["09"],
                    t: '<speaker audio="alice-music-guitar-e-1.opus">',
                },
            },
            "1": {
                a: "К Вам приходит начальник и говорит:'Вы не справляетесь со своей работой, и я вынужден вас уволить, до свидания'",
                b: -1,
                c: ["09"],
                g: '<speaker audio="alice-sounds-game-loss-3.opus">',
            },
        },
        "3": {
            a: "Вам надо сравнивать улики со всех этих дел, кажется они как-то связаны...",
            b: 3,
            c: ["0"],
            "0": {
                a: "Оказывается все пропавшие учатся в одной школе, и пропали они все сразу перед уроками. \n Вы отправляетесь в школу, в которой учились все пропавшие и заходите в кабинет директора. \n Директор выдаёт вам бумаги с информацией, но они сильно перемешаны",
                b: 4,
                c: "0",
                p: "997614/f3e8b18f9f53002b7786",
                t: '<speaker audio="alice-sounds-game-powerup-1.opus">',
                "0": {
                    a: "Директор:'Вам нужен доступ к камерам?'",
                    b: 0,
                    c: ["04", "1"],
                    "1": {
                        a: "Вам позвонил начальник и сказал:'Вы не справляетесь со своей работой, и я вынужден вас уволить, до свидания'",
                        b: -1,
                        c: ["09"],
                        t: '<speaker audio="alice-sounds-game-8-bit-phone-1.opus">',
                        g: '<speaker audio="alice-sounds-game-loss-3.opus">',
                    }
                }
            },
        },
        "4": {
            a: "На камере был замечен лучший друг детектива.\n Позвонить другу?",
            b: 0,
            c: ["0", "1"],
            t: '<speaker audio="alice-music-violin-g-1.opus">',
            "0": {
                a: "",
                b: 6,
                c: ["0"],
                "0": {
                    a: "Друг не отвечает.",
                    b: -1,
                    c: ["041"],
                    t: '<speaker audio="alice-sounds-things-phone-5.opus">',
                },
            },
            "1": {
                a: "Поехать к дому друга?",
                b: 0,
                c: ["0", "1"],
                "0": {
                    a: "Вы приехали к его дому. Постучать?",
                    b: 0,
                    c: ["0", "1"],
                    p: "1521359/3697484a0a3317924820",
                    t: '<speaker audio="alice-sounds-things-car-1.opus">',
                    "0": {
                        a: "Никто не выходит.",
                        b: -1,
                        c: ["04101"],
                        t: '<speaker audio="alice-sounds-things-door-1.opus">',
                    },
                    "1": {
                        a: "В доме не было слышно звуков. Вскрыть дверь?",
                        b: 0,
                        c: ["0", "1"],
                        "0": {
                            a: "Дверь поддалась. Обыскать дом?",
                            b: 0,
                            c: ["0", "1"],
                            p: "1652229/e9e659a5dec6ff162196",
                            t: '<speaker audio="alice-sounds-things-construction-1.opus">',
                            "0": {
                                a: "В доме вы нашли зашифрованное письмо.",
                                b: 12,
                                c: ["0"],
                                "0": {
                                    a: "Письмо:\n Сегодня я смог похитить трех детей: Екатерина, София и Егор",
                                    b: -1,
                                    c: ["04111"],
                                },
                            },
                            "1": {
                                a: "Вам позвонил начальник и сказал:'Вы не справляетесь со своей работой, и я вынужден вас уволить, до свидания'",
                                b: -1,
                                c: ["09"],
                                t: '<speaker audio="alice-sounds-game-8-bit-phone-1.opus">',
                                g: '<speaker audio="alice-sounds-game-loss-3.opus">',
                            },
                        },
                        "1": {
                            a: "Вам позвонил начальник и сказал:'Вы не справляетесь со своей работой, и я вынужден вас уволить, до свидания'",
                            b: -1,
                            c: ["09"],
                            t: '<speaker audio="alice-sounds-game-8-bit-phone-1.opus">',
                            g: '<speaker audio="alice-sounds-game-loss-3.opus">',
                        },
                    },
                },
                "1": {
                    a: "Вызвать полицию?",
                    b: 0,
                    c: ["0", "1"],
                    "0": {
                        a: "Приехала полиция, но не смогла понять где он находится",
                        b: 0,
                        c: ["04111"],
                        t: '<speaker audio="alice-sounds-things-siren-1.opus">',
                    },
                    "1": {
                        a: "Вы собрали все улики вместе и нашли примерное местоположение друга. Поехать туда?",
                        b: 0,
                        c: ["0", "1"],
                        "0": {
                            a: "Вы приехали в заброшенный дом. В доме никого небыло. Хотите его обыскать?",
                            b: 0,
                            c: ["0", "1"],
                            t: '<speaker audio="alice-sounds-things-car-1.opus">',
                            "0": {
                                a: "Вы нашли закрытый подвал, из которого доносятся голоса. Замок прийдется вскрыть.",
                                b: 8,
                                c: ["1"],
                                p: "1652229/fd1904bbb5e337bde6e2",
                                g: '<speaker audio="alice-sounds-things-construction-1.opus">',
                                "1": {
                                    a: "В подвале оказались пропавшие дети. Вы вызвали полицию, и через время вашего друга арестовали.",
                                    b: -1,
                                    c: [],
                                    g: '<speaker audio="alice-sounds-things-siren-1.opus">',
                                },
                            },
                            "1": {
                                a: "Прошло несколько минут, вы увидели, как на улице стоял ваш друг. Поговорить с ним?",
                                b: 0,
                                c: ["0", "1"],
                                "0": {
                                    a: "Друг:\n -Похоже ты догадался...\nЧтож...\n*Выстрел*",
                                    b: 0,
                                    c: ["0", "1"],
                                    t: '<speaker audio="alice-sounds-human-laugh-3.opus">',
                                    g: '<speaker audio="alice-sounds-things-gun-1.opus">',
                                },
                                "1": {
                                    a: "Забежать в дом?",
                                    b: 0,
                                    c: ["0", "1"],
                                    "0": {
                                        a: "",
                                        b: -1,
                                        c: ["0411100"],
                                    },
                                    "1": {
                                        a: "Убежать?",
                                        b: 0,
                                        c: ["0", "1"],
                                        "0": {
                                            a: "Вы захотели убежать но увидели как к дому. Подходит друг",
                                            b: -1,
                                            c: ["04111010"],
                                            t: '<speaker audio="alice-music-violin-e-1.opus">',
                                        },
                                        "1": {
                                            a: "Ваш друг начал подходить к дому, но не заметил вас. Поговорить с ним?",
                                            b: 0,
                                            c: ["0", "1"],
                                            "0": {
                                                a: "",
                                                b: -1,
                                                c: ["04111010"],
                                            },
                                            "1": {
                                                a: "Он заметил вас и побежал к дому",
                                                b: -1,
                                                c: ["04111010"],
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        "1": {
                            a: "*Звонок начальника*\n Начальник:\n -Детектив, вы уже почти раскрыли дело. Вы действительно хотите его закончить? Я вынужден вас уволить. До свидания!",
                            b: 0,
                            c: ["09"],
                            t: '<speaker audio="alice-sounds-things-phone-1.opus">',
                            g: '<speaker audio="alice-music-guitar-e-1.opus">',
                        },
                    },
                },
            },
        },
        "9": {
            a: "Прошло 2 недели. К вам в дом стучатся полицейские и сообщают, что вы подозреваетесь в похищении детей.",
            b: -1,
            c: ["2"],
            p: "1030494/8e99cf57ac4db8ce36a7",
            t: '<speaker audio="alice-sounds-things-siren-2.opus">',
            "2": {
                a: "После суда вас посадили в тюрьму. Однако настоящего виновника исчезновений не нашли...",
                b: -2,
                c: [],
                g: '<speaker audio="alice-sounds-human-laugh-3.opus">',
            },
        }
    }
}
const storyMissions={"1":{a:"Разгадайте ребус.",b:["письмо","письма"],p:"937455/a0f4d8f32811eafbbdba",},"2":{a:"Разгадайте ребус.",b:["сообщество","сообщетсва"],p:"1540737/ba7fd8f208e76a8f3c14",},"3":{a:"\nРешите задачу:\nКаждую субботу четверо друзей мылись в бане. Петр, музыкант, всегда брал с собой плейер, чтобы слушать музыку. Александр, банкир, приносил с собой термос с каким-нибудь напитком. Федр и Павел были адвокатами и всякий раз брали с собой бумаги, чтобы почитать. Однажды Павла нашли мертвым в парилке. Он был убит каким-то острым предметом. Сразу же вызвали полицию. Полицейские допросили всех троих подозреваемых, однако, зацепок не нашли. Кто убил Павла?",b:["Павла_убил_александр","Павла_убить_александр","Александр_убил_Павла","Александр_убить_павла"],p:"",},"4":{a:"Разгадайте ребус.",b:["загадка","загадки"],p:"1540737/d1b9dc2315ed9daaf44d",},"6":{a:"Найдите сумму всех цифр на картинке.",b:["45"],p:"1030494/f864475b4ce54a272c06",},"8":{a:"Найдите неизвестное число.",b:["3"],p:"997614/8304920f6692ffe1b816",},"12":{a:"Разгадайте ребус",b:["известие","известия"],p:"997614/28415d52552d8ed4d173",},}


const { json } = require('micro');
module.exports = async (req, res) => { 
    const { request, session, version, state } = await json(req);
    const sessionState = state && state.session || {};
    if (session["new"]){
        res.end(JSON.stringify(
            {
                version,
                session, 
                response: {
                    text: '',
                    tts:'Привет. Добро пожаловать в игру "Узнай правду"! Сюжетный режим представляет собой текстовое повествование с нелинейным сюжетом и разными вариантами концовок. Вы можете влиять на развитие истории благодаря выбору, который совершаете за персонажа. Аркадный режим представляет собой ряд интересных вопросов в зависимости от сложности, которую вам также предстоит выбрать! Теперь выберите режим: сюжетный или аркадный.',
                    card: {type:"BigImage",
                            "image_id": "213044/9ffce16788e5ce5e809a",
                            "description":'Привет. Добро пожаловать в игру "Узнай правду"! Сюжетный режим представляет собой текстовое повествование с нелинейным сюжетом и разными вариантами концовок. Вы можете влиять на развитие истории благодаря выбору, который совершаете за персонажа. Аркадный режим представляет собой ряд интересных вопросов в зависимости от сложности, которую вам также предстоит выбрать! Теперь выберите режим: сюжетный или аркадный.'},
                    session_state: sessionState,        
                    end_session: false,
                    buttons:[{ title: 'Помощь', hide: false },{ title: 'Сюжетный режим', hide: false },{ title: 'Аркадный режим', hide: false }]
                },
            }
        ));
    }else{
        const str = getStr(sessionState,request);
        const t = String(str[3][0])+str[0]+String(str[3][1]);
        if (str[1] == "выход"){
            res.end(JSON.stringify(
                {
                    response: {
                        text: "Выхожу..",
                        tts:t,
                        end_session:true
                    },
                    version: '1.0',
                }
            ))
        }
        else if (str[1]==""||str[1] == undefined)
        {
            res.end(JSON.stringify(
                {
                    response: {
                        text: str[0],
                        tts:t,
                        buttons:str[2]
                    },
                    session_state: sessionState,
                    version: '1.0'
                }
            ))
        }
        else{
            res.end(JSON.stringify(
                {
                    response: {
                        text: "",
                        tts:t,
                        buttons:str[2],
                        card: {type:"BigImage",
                                image_id: str[1],
                                description:str[0]
                        }
                    },
                    session_state: sessionState,
                    version: '1.0'
                }
            ))
        }
    }
};


function getStr(sessionState,request){
    let isArcade = sessionState.isArcade;
    if (isArcade == undefined) isArcade = false;
    let isStory = sessionState.isStory;
    if (isStory == undefined) isStory = false;
    let quests = sessionState.quests;
    let difficulty = sessionState.difficulty;
    if (difficulty == undefined) difficulty = "";
    let questionNum = sessionState.questionNum;
    if (questionNum == undefined) questionNum = 1;
    let questionNum2 = sessionState.questionNum2;
    if (questionNum2 == undefined) questionNum2 = 0;
    let travel = sessionState.travel;
    if (travel == undefined) travel = "0";
    let storyQuest = sessionState.storyQuest;
    if (storyQuest == undefined) storyQuest = -1;
    let str = "";
    let paintID = "";
    let buttons = [];
    let sounds = ['',''];
    if (fromAnyAction(request,["Культ кота в тапках","Культ котов в тапках"])){//пасхалочка
        str = "Стоп, стоп, стоп.. Откуда ты знаешь о его существовании? Кто тебе это рассказал? Нет, нет, нет... Это слишком секретная информация.. Никому не говори о нём или коты в тапках придут и заберут тебя."
        paintID = "1533899/39235b10b093ec5c458a";
    }
    if (fromAnyAction(request,["Выход","Выйти"])){
        str = "Выхожу.."
        return [str,"выход",[],sounds]
    }
    if (fromAnyAction(request,["умеешь","умения","уметь"])){	
        str = "В моей игре два режима. Сюжетный режим представляет собой текстовое повествование с нелинейным сюжетом и разными вариантами концовок. Вы можете влиять на развитие истории благодаря выбору, который совершаете за персонажа. Аркадный режим представляет собой ряд интересных вопросов в зависимости от сложности, которую вам также предстоит выбрать."
        return [str,"",[{ title: 'Помощь', hide: true },{ title: 'Сюжетный режим', hide: true },{ title: 'Аркадный режим', hide:true}],sounds]
    }
    if (fromAnyAction(request,["помощь","помогите"])){
        str = "Аркадный режим - включает аркадный режим\nСюжетный режим - включает сюжетный режим\nПомощь - выводит доступные команды\nВыход - выходит из игры\n"
        if (isStory){
        	str+="Повтори - говорит текущую фразу или задачу\nНачать новую игру - запускает новую игру\n\nВы можете повторить фразу или задачу."
        }
        else if (isArcade){
        	str+="Легкая/Средняя/Сложная сложность - смена сложности вопроса\nВопрос - выводит текущий вопрос\nСдаться - пропускает вопрос и говорит ответ на него\n\nВы можете повторить вопрос."
        	if (quests!= undefined){
	            quests[questionNum2]["variants"].forEach(function(item, i, q) {
	                if (item == "nan"){
	                    return;
	                }
	                buttons.push({ title: item, hide: true })
	            })
        	}else{
                    buttons.push({ title: "Лёгкая", hide: true })
                    buttons.push({ title: "Средняя", hide: true })
                    buttons.push({ title: "Сложная", hide: true })
        	}
            buttons.push({ title: "Вопрос", hide: true })
        }else{
        	buttons = [{ title: 'Сюжетный режим', hide: true },{ title: 'Аркадный режим', hide:true}]
        }
        return [str,"",[].concat(buttons,[{ title: 'Помощь', hide: true },{ title: 'Выход', hide: true }]),sounds]
    }
    if (fromAnyAction(request,["Сюжетный режим","сюжет", "сюжетка","сюжетку"])){
        if (isStory == false){
            str = ["Хорошо, запускаю Сюжетный режим\n","Запускаю Сюжетный режим\n"][Math.floor(Math.random() * 2)];
            isStory = true;
            isArcade = false;
            difficulty = "";
        }else{
            str = ["Вы уже в сюжетном режиме","Вы уже находитесь в сюжетном режиме"][Math.floor(Math.random() * 2)];
            difficulty = "";
        }
    }
    if (isStory){
      	if (fromAnyAction(request,["новую игру","новая игра","новые игры"])){
      		str+="Вы начали новую игру\n";
    		travel = "0";
    		storyQuest = -1;
    	}
    	if (fromAnyAction(request,["Повтори","повтор","вопрос","повторка","повторить","фраза","вопрос","ребус","фразы","вопросы","ребусы"])){
		    const storyObj = getStoryObj(travel,story);
    		str+=storyObj.a+"\n";
    		if (storyObj.t!= undefined){
    			sounds[0] = storyObj.t;
    		}
			if (storyObj.g!= undefined){
    			sounds[1] = storyObj.g;
			}
            if (storyObj.p != undefined){
                paintID = storyObj.p
            }
      	}
      	else{
	        if (storyQuest>0)
	        {  
	            if (getAns(request,[storyMissions[String(storyQuest)].b],-2)!= -1){
	                str+=["Правильно!\n","Молодец!\n","Молодец, правильно!\n","Неплохо!\n"][Math.floor(Math.random() * 4)];
	                storyQuest = -1;
	                const travelC = getStoryObj(travel,story).c[0];
	                if (travelC.length == 1){
	                    travel+=travelC
	                }else{
	                    travel = travelC;
	                }
	            }
	            else{
	                str =["Пока неправильно, можешь попробовать еще раз.","Неправильно.","Ответ неверный.","Неверно.","Пока неправильно."][Math.floor(Math.random() * 5)]
	            }
	            if (fromAnyAction(request,["Повтори","повтор","вопрос","повторка","повторить","фраза","вопрос","ребус","фразы","вопросы","ребусы"])){
	                str = storyMissions[String(storyQuest)].a;
	                paintID = storyMissions[String(storyQuest)].p; 
	            }
	            if (fromAnyAction(request,["сдаюсь","сдаваться","сдаётся","сдаться"])){
	                str ="Правильный ответ был "+storyMissions[String(storyQuest)].b[0].replace(/_/gi," ")+"\n";
	                storyQuest = -1;
	                const travelC = getStoryObj(travel,story).c[0];
	                if (travelC.length == 1){
	                    travel+=travelC
	                }else{
	                    travel = travelC;
	                }
	            }

	        }
	        if (storyQuest<=0)
	        {  
	            if (storyQuest != -2){
	                let num3 = -1;
	                if (storyQuest == 0){
	                    num3 =  getAns(request, [["да"],["нет"]])
	                }
	                if (num3!=-1){
	                    const travelC = getStoryObj(travel,story).c[num3];
	                    if (travelC.length == 1){
	                        travel+=travelC
	                    }else{
	                        travel = travelC;
	                    }
	                }
	                while (true){
	                    if (storyQuest == 0 && num3 == -1){
	                        str = dontGetAns();
	                        break;
	                    }
	                    const storyObj = getStoryObj(travel,story);
	                    if (storyObj.t!= undefined){
			    			sounds[0] = storyObj.t;
			    		}
						if (storyObj.g!= undefined){
			    			sounds[1] = storyObj.g;
						}
	                    if (storyQuest.p != undefined){    
	                        paintID = storyObj.p;
	                    }
	                    str+=storyObj.a+"\n";
	                    sounds.push(storyObj.t)
    					sounds.push(storyObj.g)
	                    if (storyObj.p != undefined){
	                        paintID = storyObj.p
	                    }
	                    storyQuest = storyObj.b;
	                    if (storyQuest>0){
	                        str += "\n\n";
	                        str+=storyMissions[String(storyQuest)].a;
	                        paintID = storyMissions[String(storyQuest)].p; 
	                        break;
	                    }
	                    if (storyObj.c.length == 1){
	                        if (storyObj.c[0].length == 1){
	                            travel += storyObj.c[0];
	                        }else{
	                            travel = storyObj.c[0];
	                        }
	                        storyQuest= -1;
	                        continue;
	                    }
	                    buttons.push({ title: 'Да', hide: true });
	                    buttons.push({ title: 'Нет', hide: true });

	                    if (storyQuest >= 0){
	                        break;
	                    }
	                    if (storyObj.c.length == 0){
	                        str+="Вы прошли сюжет. Хотите начать заного?"
	                        storyQuest = -2;
	                        break
	                    }
	                }
	            }
	            else{
	                let num3 = -1;
	                num3 =  getAns(request, [["да"],["нет"]])
	                if (num3 == -1){
	                    str = dontGetAns();
	                }
	                else{
	                    if (num3 == 1){
	                        str = "Выберете режим сюжетный или аркадный."
	                        isArcade = false;
	                        isStory = false;
	                        storyQuest = -1;
	                        travel = "0";
	                        buttons = [{ title: 'Сюжетный режим', hide: true },{ title: 'Аркадный режим', hide:true}]
	                    }else{
	                        isArcade = false;
	                        isStory = true;
	                        storyQuest = -1;
	                        travel = "0";
	                    }
	                }
	            }
	        }
    	}

    }
    if (isArcade){
        const num = getAns(request,[["Лёгкая","легкая","лёгкий","легкий","легко","легкую"],["Средняя","средний","средне","среднюю","Нормальная","нормальную","нормальный","нормально"],["Сложная","сложно","сложно","сложную","сложна"]],-2);
        if (difficulty == ""){
            if (num!=-1){
                difficulty = ["Лёгкая","Средняя","Сложная"][num];
                questionNum = 1;
                str = "Вы выбрали "+["лёгкую","среднюю","сложную"][num]+" сложность. ";
                if (num == 2){
                    str += ["При выборе сложного уровня у вас не будет подсказок.","При выборе сложного уровня подсказки будут недоступны.","На сложном уровне подсказки отсуствуют."][Math.floor(Math.random() * 3)];
                }
                str+="\n";
            }else{
                str = dontGetAns();
                    buttons.push({ title: "Лёгкая", hide: true })
                    buttons.push({ title: "Средняя", hide: true })
                    buttons.push({ title: "Сложная", hide: true })
            }
        }
        else{
            if (num!=-1){
                difficulty = ["Лёгкая","Средняя","Сложная"][num];
                questionNum2 = 0; 
                str = "Вы изменили сложность на "+["лёгкую.","среднюю.","сложную. "+["При выборе сложного уровня у вас не будет подсказок.","При выборе сложного уровня подсказки будут недоступны.","На сложном уровне подсказки отсуствуют."][Math.floor(Math.random() * 3)]][num]+"\n"; 
                inQuest = false;
                quests = undefined;
            }
        }
        if (difficulty!=""){
            if (quests==undefined){
                quests =  JSON.parse(JSON.stringify(arcade[difficulty]));
                questionNum2 = Object.keys(quests)[Math.floor(Math.random() * Object.keys(quests).length)];
                str +="Вопрос номер "+String(questionNum)+".\n";
                str += quests[questionNum2]["question"]+"\n";
                quests[questionNum2]["variants"].forEach(function(item, i, q) {
                    if (item == "nan"){
                        return;
                    }
                    buttons.push({ title: item, hide: true })
                    str+=String(i+1)+". "+ item+"\n";
                })
                                         buttons.push({ title: "Вопрос", hide: true })
            }else{
                const num2 = getAns(request,[quests[questionNum2]["correctAnswer"][0]],quests[questionNum2]["correctAnswer"][1]);

                if (num2==-1){
                    if (fromAnyAction(request,["вопрос","потвтори","повторить","повтор"])){
                        str +="Вопрос номер "+String(questionNum)+".\n";
                        str += quests[questionNum2]["question"]+"\n";
                        quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                                if (item == "nan"){
                        return;
                    }
                                        buttons.push({ title: item, hide: true })
                            str+=String(i+1)+". "+ item+"\n";
                        })
                                                 buttons.push({ title: "Вопрос", hide: true })
                    }
                    else if(fromAnyAction(request,["сдаюсь","сдаваться","сдаётся","сдаться"])){
                        str += "Правильный ответ был "+quests[questionNum2]["correctAnswer"][0][0].replace(/_/gi," ")+".\n";
                        questionNum+=1;
                        delete quests[questionNum2]; 
                        if (Object.keys(quests).length == 0){
                            quests =  JSON.parse(JSON.stringify(arcade[difficulty]));
                            const questionNum2 = Object.keys(quests)[Math.floor(Math.random() * Object.keys(quests).length)];
                            str +="Вопрос номер "+String(questionNum)+".\n";
                            str += quests[questionNum2]["question"]+"\n";
                            quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                                    if (item == "nan"){
                        return;
                    }
                                        buttons.push({ title: item, hide: true })
                                str+=String(i+1)+". "+ item+"\n";
                            })
                        }else{
                            questionNum2 = Object.keys(quests)[Math.floor(Math.random() * Object.keys(quests).length)];
                            str +="Вопрос номер "+String(questionNum)+".\n";
                            str += quests[questionNum2]["question"]+"\n";
                            quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                                    if (item == "nan"){
                        return;
                    }
                                        buttons.push({ title: item, hide: true })
                                str+=String(i+1)+". "+ item+"\n";
                            })
                                                     buttons.push({ title: "Вопрос", hide: true })
                        }
                    }
                    else if(fromAnyAction(request,["подсказка","подскажи","подсказку","подсказки","подсказать"])){
                        if (quests[questionNum2]["hints"].length>0){
                            if (quests[questionNum2]["hints"][0] != "-1"){
                                str+="Подсказка:\n"+quests[questionNum2]["hints"][0]
                                quests[questionNum2]["hints"].shift()
                            }
                            else
                            {
                                 str+="У данной задачи нет подсказок. Если у тебя не получается можешь сдаться.";
                                quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                    if (item == "nan"){
                                        return;
                                    }
                                    buttons.push({ title: item, hide: true })
                                })
                                buttons.push({ title: "Вопрос", hide: true })
                            }
                        }else{
                            str+="К сожалению подсказки кончились. Если у тебя не получается можешь сдаться.";
                            quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                if (item == "nan"){
                                    return;
                                }
                                buttons.push({ title: item, hide: true })
                            })
                            buttons.push({ title: "Вопрос", hide: true })

                        }

                    }
                    else{
                        if (str==""){
                            str = ["Пока неправильно, можешь попробовать еще раз.","Неправильно.","Ответ неверный.","Неверно.","Пока неправильно."][Math.floor(Math.random() * 5)]
							sounds[0] = '<speaker audio="alice-sounds-game-loss-2.opus">';
                            quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                if (item == "nan"){
                                    return;
                                }
                                buttons.push({ title: item, hide: true })
                            })
                            buttons.push({ title: "Вопрос", hide: true })
                        }
                    }
                }else{
                    str += ["Правильно!\n","Молодец!\n","Молодец, правильно!\n","Неплохо!\n"][Math.floor(Math.random() * 4)];
                    sounds[0] = '<speaker audio="alice-sounds-game-win-1.opus">';

                    questionNum+=1;
                    delete quests[questionNum2]; 
                    if (Object.keys(quests).length == 0){
                        quests =  JSON.parse(JSON.stringify(arcade[difficulty]));
                        questionNum2 = Object.keys(quests)[Math.floor(Math.random() * Object.keys(quests).length)];
                        str +="Вопрос номер "+String(questionNum)+".\n";
                        str += quests[questionNum2]["question"]+"\n";
                        quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                                if (item == "nan"){
                        return;
                    }
                                                            buttons.push({ title: item, hide: true })
                            str+=String(i+1)+". "+ item+"\n";
                        })
                        buttons.push({ title: "Вопрос", hide: true })
                    }else{
                        questionNum2 = Object.keys(quests)[Math.floor(Math.random() * Object.keys(quests).length)];
                        str +="Вопрос номер "+String(questionNum)+".\n";
                        str += quests[questionNum2]["question"]+"\n";
                        quests[questionNum2]["variants"].forEach(function(item, i, q) {
                                                if (item == "nan"){
                        return;
                    }
                                                            buttons.push({ title: item, hide: true })
                            str+=String(i+1)+". "+ item+"\n";
                        })
                        buttons.push({ title: "Вопрос", hide: true })
                    }
                }
            }
        }

    }
    if (fromAnyAction(request,["Аркадный режим","аркада", "аркадный","аркаду"])){
        if (isArcade){
            str = ["Вы уже в аркадном режиме","Вы уже находитесь в аркадном режиме"][Math.floor(Math.random() * 2)];
        }else{
            str = ["Хорошо, теперь выберите сложность: Лёгкая, Средняя или Сложная","Отлично, теперь выберите сложность: Лёгкая, Средняя или Сложная"][Math.floor(Math.random() * 2)];
            isStory = false;
            isArcade = true;
            buttons.push({ title: "Лёгкая", hide: true })
            buttons.push({ title: "Средняя", hide: true })
            buttons.push({ title: "Сложная", hide: true })
        }
    }
    sessionState.isArcade = isArcade;
    sessionState.isStory = isStory;
    sessionState.quests = quests;
    sessionState.difficulty = difficulty;
    sessionState.questionNum = questionNum;
    sessionState.questionNum2 = questionNum2;
    sessionState.travel = travel;
    sessionState.storyQuest = storyQuest;
    return [str,paintID, [].concat(buttons,[{ title: 'Помощь', hide: true },{ title: 'Выход', hide: true }]),sounds];
}



function getStoryObj(travel,story){
    let obj = story;
    for(var i = 0;i<travel.length;i++){
        obj = obj[travel[i]]
    }
    return obj;
}



function fromAnyAction(r,variants) {
    var a = r["command"].toLowerCase();
    var b = false;
    variants.forEach(function(item, i, variants) {
        if (a.indexOf(item.toLowerCase())!= -1){
            b = true;
        }
    })
    return b;
}   

function getAns(r, variants, arc = -1) {   
    let a = r["command"].split(/[!#$%&()*+,\-./:<=>?@^`{|}№;]|\u005b|\u005d/).filter(Boolean);
    let str = "";
    let d = "";
    let ind = -1;
    let b = false, c = false,e = false;
    if (variants[0][0] == "да" && variants[1][0] == "нет"){
        variants = [["да","ага","угу"],["нет","неа","не","никак"]]
        b = true;
    }
    if (variants.length>1){
        if (variants[1][0] == "не"){
            c = true;
        }
    }
    a.forEach(function(aitem, o, a) {
        variants.forEach(function(item, i, variants) {
            item.forEach(function(itemVar, i2, item) {
                if (aitem.toLowerCase().indexOf(itemVar.toLowerCase())==0){
                    ind = i;
                    if (c){
                        if (aitem == "не"){
                            e = true;
                        }
                    }
                }
            })
        })

    })
    if (variants[0][0].toLowerCase().indexOf("_") != -1&&ind == -1){
        var k = 0;
        variants.forEach(function(item, i, variants) {
            k = 0;
            item.forEach(function(itemVar, i2, item) {
                if (r["original_utterance"].indexOf(itemVar.split(/_/gi, ' '))!=-1){
                    k += 1;
                }   
            })
            if (k>variants[i].length){
                ind = i;
            }
        })
    }
    if (b){
        if (r["original_utterance"].indexOf("я за")!= -1){
            ind = 0;
        }
    }
    if (e){
        ind = 1;
    }
    return String(ind);
}

function dontGetAns(){
    return ["Извините, я вас не понял, можете повторить?","Не понял вас, можете повторить?","Я вас не понял, можете повторить?","Извините, не до конца понял вас, можете повторить?"][Math.floor(Math.random() * 4)];;
}

const PORT = 3000;